app/views/participations/show.html.erb

SELECT "attendances".* FROM "attendances" WHERE "attendances"."event_id" = $1  [["event_id", 14]]
SELECT COUNT(*) FROM "attendances" WHERE "attendances"."event_id" = $1  [["event_id", 14]]
---
<h1><%= @event.title %></h1>
<p class="">inscrit : <%= @event.attendances.count %></p>

SELECT "attendances".* FROM "attendances" WHERE "attendances"."event_id" = $1  [["event_id", 14]]
---
<div>
	<% @event.attendances.each do |event| %>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
---
        	<div class="card-header border border-dark bg-info">
        		<p class="text-warning">participe :<%= event.user.first_name %></p>