app/views/user_mailer/inscription_event_email.html.erb

  <body>
    <h1>Salut <%= @attendance.event.user.first_name %> nouvel inscrit pour : <%= @attendance.event.title %> !</h1>
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 19], ["LIMIT", 1]]