app/views/events/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
        	<div class="card-body">
        		<a class="text-warning" href="/events/<%= event.id %>">author:<%= event.user.first_name %></a>