app/views/events/show.html.erb

		<br/>
		<a class="text-info pr-5" href="/users/<%= @event.user.id %>">author : <%= @event.user.first_name %></a>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

		<% if current_user == @event.user %>
			<a class="text-info pr-5" href="/events/<%= @event.id %>/participations/<%= @event.id %>">nombre de participation : <%= @event.attendances.count %></a>
		<% elsif current_user != @event.user %>
			<p class="text-warning">nombre de participation : <%= @event.attendances.count %></p>
---
SELECT  "attendances".* FROM "attendances" ORDER BY "attendances"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT COUNT(*) FROM "attendances" WHERE "attendances"."event_id" = $1  [["event_id", 14]]
SELECT COUNT(*) FROM "attendances" WHERE "attendances"."event_id" = $1  [["event_id", 1]]

		<% else %>
			<p class="text-warning">nombre de participation : <%= @event.attendances.count %></p>
---
SELECT COUNT(*) FROM "attendances" WHERE "attendances"."event_id" = $1  [["event_id", 1]]