app/controllers/events_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "events" SET "title" = $1, "start_date" = $2, "updated_at" = $3 WHERE "events"."id" = $4  [["title", "coucoucoucouc"], ["start_date", "2019-03-09 00:00:00"], ["updated_at", "2019-02-14 00:54:47.648869"], ["id", 15]]
---
    def update
    @event = Event.find(params[:id])
    parasol = params["event"]
    if @event.update(title: parasol["title"], description: parasol["description"], start_date: params["start_date"].to_datetime, duration: parasol["duration"], price: parasol["price"], location: parasol["location"])

INSERT INTO "events" ("start_date", "duration", "title", "description", "price", "location", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
	@event = Event.new(title: params["title"], description: params["description"], start_date: params["start_date"], duration: params["duration"], price: params["price"], location: params["location"])
  	@event.user = current_user
    if @event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT "attendances".* FROM "attendances"
---
  def show
    @b = false
    @event = Event.find(params["id"])
    if current_user
    Attendance.all.each do |a|

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT COUNT(*) FROM "attendances" WHERE "attendances"."event_id" = $1  [["event_id", 15]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 15]]
---
  def destroy
    @desevent = Event.find(params["id"])
    if @desevent.attendances.count == 0
      @desevent.destroy