app/controllers/participations_controller.rb

INSERT INTO "attendances" ("created_at", "updated_at", "user_id", "event_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2019-02-13 18:18:08.247943"], ["updated_at", "2019-02-13 18:18:08.247943"], ["user_id", 19], ["event_id", 1]]
---
  def create
    @attendance = Attendance.new(user_id: current_user.id, event_id: params["event_id"])
    if @attendance.save