app/controllers/participations_controller.rb

  def new
    #if Attendance.where(user: current_user.id.to_s)
    #  redirect_to "/events"
    #end
    @event = Event.find(params["event_id"])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
        # Amount in cents
    @event = Event.find(params["event_id"])

    @amount = @event.price * 100

    customer = Stripe::Customer.create(
      :email => params[:stripeEmail],
      :source  => params[:stripeToken]
    )

    charge = Stripe::Charge.create(
      :customer    => customer.id,
      :amount      => @amount,
      :description => 'Rails Stripe customer',
      :currency    => 'usd'
    )
    puts "****************************"
    puts params
    @attendance = Attendance.new(user_id: current_user.id, event_id: params["event_id"], stripe_customer_id: params["stripeToken"])
    if @attendance.save
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
INSERT INTO "attendances" ("stripe_customer_id", "created_at", "updated_at", "user_id", "event_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["stripe_customer_id", "tok_1E3Y1hByO3QMDV0ty1YRrgcD"], ["created_at", "2019-02-14 00:24:35.146582"], ["updated_at", "2019-02-14 00:24:35.146582"], ["user_id", 25], ["event_id", 1]]

  def show
    @event = Event.find(params["id"])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]